[
  {
    "type": "Ball",
    "title": "Ball of the Century: Shane Warne's Delivery to Mike Gatting (1999 Ashes)",
    "description": "A delivery that defied logic, spinning viciously from outside the leg stump to clip Mike Gatting's bails. This moment marked the arrival of Shane Warne as a legend.",
    "image": "https://www.espncricinfo.com/story/why-the-gatting-ball-is-not-the-best-of-the-century-918365"
  },
  {
    "type": "Shot",
    "title": "Sachin Tendulkar's Straight Drive at Lord's (1990)",
    "description": "A young Tendulkar's majestic straight drive off a fast bowler at the iconic Lord's Cricket Ground announced his arrival on the world stage.",
    "image": "https://www.espncricinfo.com/cricketers/sachin-tendulkar-35320"
  },
  {
    "type": "Celebration",
    "title": "Adam Gilchrist's Bat Flip at Sydney (2003 World Cup)",
    "description": "A jubilant celebration after hitting a six to win the 2003 World Cup final for Australia.",
    "image": "https://www.icc-cricket.com/news/adam-gilchrist-inducted-into-the-icc-cricket-hall-of-fame"
  },
  {
    "type": "Catch",
    "title": "Jonty Rhodes' Flying Catch at Centurion (1992 World Cup)",
    "description": "A gravity-defying one-handed diving catch by Jonty Rhodes to dismiss Inzamam-ul-Haq, considered one of the greatest ever taken.",
    "image": "https://www.espncricinfo.com/story/a-catch-that-drew-applause-from-jonty-rhodes-454733"
  },
  {
    "type": "Ball",
    "title": "Wasim Akram's Inswing Yorker to Robin Smith (1992 World Cup)",
    "description": "A perfectly executed delivery that rattled Robin Smith's stumps and turned the tide of the 1992 World Cup final.",
    "image": "https://www.youtube.com/watch?v=vI3kw0hpwsw"
  },
  {
    "type": "Shot",
    "title": "VVS Laxman's 281 at the SCG (2001 Border-Gavaskar Trophy)",
    "description": "A gritty and defiant double century against all odds on a turning Sydney Cricket Ground pitch, helping India win a historic Test match.",
    "image": "https://www.espncricinfo.com/cricketers/vvs-laxman-30750/bowling-batting-stats"
  },
  {
    "type": "Shot",
    "title": "MS Dhoni's Helicopter Shot in World Cup Final (2011)",
    "description": "A cool and calculated shot to finish the 2011 World Cup final for India in style.",
    "image": "https://m.youtube.com/watch?v=yWZx0c45Yx8"
  },
  {
    "type": "Shot",
    "title": "Brian Lara's 501 (2003)",
    "description": "Lara's record-breaking innings of 501 not out against England remains the highest individual score in Test cricket history.",
    "image": "https://www.espncricinfo.com/series/britannic-assurance-county-championship-1994-462129/warwickshire-vs-durham-462128/full-scorecard"
  },
  {
    "type": "Ball",
    "title": "Mitchell Johnson's Yorker to Stuart Broad (2013 Ashes)",
    "description": "A brutal, fast yorker that dismantled Stuart Broad's stumps and symbolized Australia's dominance in the 2013 Ashes series.",
    "image": "https://www.espncricinfo.com/photo/mitchell-johnson-with-girlfriend-jessica-bratich-273861"
  },
  {
    "type": "Celebration",
    "title": "Yuvraj Singh's Six Sixes off Stuart Broad (2007 World Cup)",
    "description": "An incredible feat of hitting six consecutive sixes off a single over, etching his name in cricket history.",
    "image": "https://www.espncricinfo.com/cricketers/yuvraj-singh-36084/bowling-batting-stats"
  },
  {
    "type": "Run Out",
    "title": "Ricky Ponting's Run Out of Inzamam-ul-Haq (2003 World Cup Final)",
    "description": "A crucial run-out that turned the tide in the thrilling 2003 World Cup final.",
    "image": "https://www.espncricinfo.com/cricketers/ricky-ponting-7133/bowling-batting-stats"
  },
  {
    "type": "Wicket",
    "title": "Muttiah Muralitharan's 800th Test Wicket (2007)",
    "description": "Becoming the first bowler to reach 800 Test wickets, a record that still stands today.",
    "image": "https://www.espncricinfo.com/story/muttiah-muralitharan-stats-analysis-467578"
  },
  {
    "type": "Catch",
    "title": "Andrew Symonds' One-Handed Catch at Point (2006 Ashes)",
    "description": "A spectacular one-handed catch at point to dismiss Kevin Pietersen, a turning point in the 2006 Ashes series.",
    "image": "https://dummyurl.com"
  }
]
